import java.util.Date;

public class ChipherGenerator {
    public static void main(String[] args) {
        String[] symbols = {"◇","☉","⁃","□","▷","↼","↽","↾","↿","⇀","⇁","⇂","⇃","Ł","◬","ᚣ","ᚬ",
                "ᚻ","ᛇ","ᛋ","ᛉ","ᛞ","ᛗ","ᛟ","〈」","〉⌈","⌉〈","⳺","ᖷ","△","▽","▷","◁","♮","⊖","⊕","∑",
                "⊗","⊘","⊙","⊞","⊟","⊠","⊡","⋇","⋋","⋌","∀","∃","⊏","⊐","⋈","⋉","⋊","⟂","⦡","⊿",
                "⊢","⊣","∧","⋂","⋃","¬","♇","⯘","ᛧ」","Ⰽ","ⵇ","ⵅ","ⵃ","ⴳ","Ⱎ","⟓","⟔","⟐","ᖵ","ᖶ", "⍋","⦺","╹","ᛝ"
        };
        System.out.println("Внимание: некоторые символы могут отоброжаться неправильно, скопируйте их в Google Docs что-бы проверить");
        for (int i = 0; i < 33; i++){

        }
    }
}
