import java.util.Scanner;

public class Test {
    public static void main(String[] args) {
        String[] map = {
                "      ┌────────────────┐┌─────┐  |||||||||||||||||||||||||||||||||||",//┼ ┤┬┴├ ┌└┘┐ ─│
                "      ░                ││     │ ||||||||||||||||||||||||||||||||||||",
                "      ░▒▒  ▒▒▒▒      ▒▒││     │ ||||||||||||||||||||||||||||||||||||",
                "      │▒▒  ▒▒▒▒               │ ||||||||||||||||||||||||||||||||||||",
                "      └────────────────┘│     │ ||||||||||||||||||||||||||||||||||||",
                "┌────┐┌────────────────┐│     │|||||||||||||||||||||||||||||||||||||",
                "│    ││▒                      │|||||||||||||||||||||||||||||||||||||",
                "│    ░░▒               ││     │|||||||||||||||||||||||||||||||||||||",
                "│    ░░            ▒▒▒▒││     │|||||||||||||||||||||||||||||||||||||",
                "│    │▒            ▒▒▒▒││     │|||||||||||||||||||||||||||||||||||||",
                "│    │└────────────────┘│     │|||||||||||||||||||||||||||||||||||||",
                "│    │┌───────────┐┌────┘     │|||||||||||||||||||||||||||||||||||||",
                "│    ░░            ▒          │|||||||||||||||||||||||||||||||||||||",
                "│    ░░           │├─   ─┬─  ─┤|||||||||||||||||||||||||||||||||||||",
                "│    ││           ││     │    │|||||||||||||||||||||||||||||||||||||",
                "└────┘└───────────┘└─────┴────┤|||||||||||||||||||||||||||||||||||||",
                "│    │||||||||||||||||||│     │|||||||||||||||||||||||||||||||||||||",
                "│    │||||||||||||||||||│     │|||||||||||||||||||||||||||||||||||||",
                "│    │||||||||||||||||||│     │|||||||||||||||||||||||||||||||||||||",

        };

        String[][] places = {
                {"ЖК имени Ярослава"  ,"Кафе 'Под мостом'"     ,"Трущобы Кирилла"            ,"'батарея'"},
                {"Авто центр"         ,"ТЦ 'У мамы'"           ,"Выезд в деревню 'Балконную'"},
                {"Парковка 'диванная'","Парковка 'подстольная'","Небоскреб 'холодильный'"    },
                {"Книжный магазин"    ,"'верхушка'"            }
        };
        String[] streets = {"Детская","Зальная","Кухонная","Горная",};

        int r = MolniyarMethod.randomNumber(0,3);
        int h = MolniyarMethod.randomNumber(0,places[r].length-1);
        System.out.println("Откуда: "+ "Улица: " + streets[r] + ", Здание: " + places[r][h]);


        int R = MolniyarMethod.randomNumber(0,3);
        int H = MolniyarMethod.randomNumber(0,places[R].length-1);
        if (r==R && h==H){H = (H+1)%places[R].length;}
        System.out.println("Куда:   "+ "Улица: " + streets[R] + ", Здание: " + places[R][H]);
    }
}